Repository: AnsoATC/ros_navigation_command_app
Catalog: lib/l10n/intl_*.arb
Languages: pl

# tooltipStopActions
source: Stop actions
pl: Zatrzymaj akcje robota

# tooltipRefreshConnection
source: Refresh connection
pl: Odśwież połączenie

# tooltipSettings
source: Settings
pl: Ustawienia

# tooltipChatMode
source: Text input
pl: Polecenie tekstowe

# tooltipChatStar
source: Quick Replies
pl: Szybkie odpowiedzi

# tooltipRandom
source: Random name
pl: Wylosuj nazwę

# tooltipCurrentLocation
source: Current robot location
pl: Aktualne położenie robota

# tooltipCoordinates
source: Coordinates
pl: Ręczne koordynaty

# pageChatTexting
source: Order
pl: Polecenie

# pageChatRecording
source: Recording
pl: Nagrywam...

# pageControllerInfoTitle
source: Waiting for cammera topic
pl: Czekam na obraz z kamery

# pageMapTitle
source: Map
pl: Mapa

# pageMapInfoTitle
source: Waiting for map topic
pl: Czekam na obraz mapy

# pageMapButtonGrid
source: Show / hide grid
pl: Pokaż / ukryj siatkę

# pageMapButtonFloating
source: Add new map marker
pl: Utwórz nowy znacznik lokalizacyjny

# pageSettingsTitle
source: Settings
pl: Ustawienia

# pageSettingsGeneral
source: {type, select, title {App settings} desc {General settings & accessibility}}
pl: {type, select, title {Ustawienia aplikacji} desc {Ogólne ustawienia i opcje dostępu}}

# pageSettingsThemes
source: {theme, select, light {Light theme} dark {Dark theme} system {System theme}}
pl: {theme, select, light {Jasny motyw} dark {Ciemny motyw} system {Systemowy motyw}}

# pageSettingsAnimations
source: {type, select, title {Limit animations} desc {Changes how lists and messages animate}}
pl: {type, select, title {Ogranicz animacje} desc {Zmienia zachowanie list, wiadomości}}

# pageSettingsButtonsDesc
source: {type, select, title {Button labels} desc {Show additional labels under buttons}}
pl: {type, select, title {Podpisy przycisków} desc {Dodaje podpisy pod przyciskami nawigacji}}

# pageSettingsRos
source: {type, select, title {Ros configuration} desc {Ros web config of main and current device}}
pl: {type, select, title {Konfiguracja ROS} desc {Konfiguracja sieciowa ROS, należy wprowadzić adres urządzenia roscore i adres ip aktualnego urządzenia}}

# pageSettingsRosMain
source: Main server (ip)
pl: Główny serwer (ip)

# pageSettingsRosDevice
source: This device (ip)
pl: To urządzenie (ip)

# pageSettingsRosOdom
source: Odometry
pl: Odometria robota

# pageSettingsRosCamera
source: Camera
pl: Kamera

# pageSettingsRosBattery
source: Battery
pl: Bateria

# pageSettingsRosVelocity
source: Linear / angular velocity
pl: Prędkość liniowa / kątowa silników

# pageSettingsRosMap
source: Map
pl: Mapa

# pageSettingsRosNavigation
source: Navigation / Goal
pl: Nawigacja / Cel

# pageSettingsAbout
source: About
pl: O aplikacji

# creatorAddNew
source: Add new marker
pl: Dodaj nowy znacznik

# creatorEdit
source: Edit marker
pl: Edytuj znacznik

# creatorName
source: Name
pl: Nazwa

# creatorHue
source: Hue
pl: Barwa
